const rules = {
  required: (v) => !!v || '必填選項',
  min1: (v) => /^.{1,}$/.test(v) || '請勿小於一字元',
  min2: (v) => /^.{2,}$/.test(v) || '請勿小於二字元',
  max20: (v) => /^.{0,20}$/.test(v) || '請勿超過二十字元',
  max50: (v) => /^.{0,50}$/.test(v) || '請勿超過五十字元',
  max100: (v) => /^.{0,100}$/.test(v) || '請勿超過一百字元',
  max200: (v) => /^.{0,200}$/.test(v) || '請勿超過兩百字元',
  alpha_num: (v) => /^[A-Za-z0-9]+$/.test(v) || '僅限大小寫英文與數字',
  alpha_dash: (v) => /^\w*$/.test(v) || '僅限大小寫英文、數字、底線',
  // alpha_dash: (v) =>
  //   /^[A-Za-z0-9_@-]+$/.test(v) || '僅限大小寫英文、數字、@、_、-',
  email: (v) =>
    /^\w+((-\w+)|(\.\w+))*@[A-Za-z0-9]+((\.|-)[A-Za-z0-9]+)*\.[A-Za-z]+$/.test(
      v
    ) || 'e-mail格式不正確',
  ip: (v) =>
    /^((?:(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?)\.){3}(?:25[0-5]|2[0-4][0-9]|[01]?[0-9][0-9]?))*$/.test(
      v
    ) || 'ip格式不正確',
  url: (v) =>
    /(https?:\/\/(?:www\.|(?!www))[a-zA-Z0-9][a-zA-Z0-9-]+[a-zA-Z0-9]\.[^\s]{2,}|https?:\/\/(?:www\.|(?!www))[a-zA-Z0-9]+\.[^\s]{2,})/gi.test(
      v
    ) ||
    !v ||
    '網址格式不正確'
}

export default {
  rules
}
